insta_inspire_app_api/app/controllers/quotes_controller.rb

  def show
    quote = Quote.find(params[:id])
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    quote = Quote.new(quote_params)
    quote.user_id = params[:user_id]
    if quote.save
---
INSERT INTO "quotes" ("text", "created_at", "updated_at", "user_id", "mood") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def destroy
    quote = Quote.find(params[:id])
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def search
    quotes = Quote.where(mood: params[:q])
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."mood" = $1  [["mood", "overwhelmed"]]